app/controllers/lists_controller.rb

SELECT "lists".* FROM "lists"
---
  def index
    @lists = List.all

INSERT INTO "lists" ("Idea", "Planning", "Upcoming", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["Idea", ""], ["Planning", "hi"], ["Upcoming", ""], ["created_at", "2015-06-09 05:03:06.828143"], ["updated_at", "2015-06-09 05:03:06.828143"]]
---
  def create
    @list = List.new(list_params)
    @list.save

SELECT  "lists".* FROM "lists"  WHERE "lists"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_list
      @list = List.find(params[:id])