app/controllers/pins_controller.rb

SELECT  "pins".* FROM "pins"   ORDER BY created_at DESC LIMIT 8 OFFSET 0
SELECT COUNT(*) FROM "pins"
---
  def index
    @pins = Pin.all.order("created_at DESC").paginate(:page => params[:page], :per_page => 2)

INSERT INTO "pins" ("created_at", "description", "updated_at") VALUES (?, ?, ?)  [["created_at", "2015-06-07 21:27:14.076062"], ["description", "testestest"], ["updated_at", "2015-06-07 21:27:14.076062"]]
---
  def create
    @pin = current_user.pins.build(pin_params)

    if @pin.save

UPDATE "pins" SET "description" = ?, "updated_at" = ? WHERE "pins"."id" = 1  [["description", "testes"], ["updated_at", "2015-06-07 22:16:24.398811"]]
---
  def update
    if @pin.update(pin_params)

DELETE FROM "pins" WHERE "pins"."id" = ?  [["id", 6]]
---
  def destroy
    @pin.destroy

SELECT  "pins".* FROM "pins"  WHERE "pins"."id" = ? LIMIT 1  [["id", 2]]
---
    def set_pin
      @pin = Pin.find_by(id: params[:id])